---
kind: property
id: P:Autodesk.Revit.DB.CurveByPoints.Visible
source: html/fe052840-c872-dcbd-c2b3-ca088be27c4b.htm
---
# Autodesk.Revit.DB.CurveByPoints.Visible Property

Whether the point is visible when the family is loaded
into a project.

## Syntax (C#)
```csharp
public bool Visible { get; set; }
```